<!DOCTYPE html>>
<html>
 <head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>Калькулятор ЕГЭ 2020</title>
 </head>
 <body>
 </body>
 <script>
    'use strict';
    let retu = true;
while(retu){
    let informat = prompt('Сколько у вас баллов по информатике?', '');
    while(Number(informat)>100){
    alert('Не может быть более 100 баллов!');
    informat = prompt('Сколько у вас баллов по информатике?', '');
    }
    let math = prompt('Сколько у вас баллов по математике?', '');
    while(Number(math)>100){
    alert('Не может быть более 100 баллов!');
    math = prompt('Сколько у вас баллов по математике?', '');
    }
    let Rysianlang = prompt('Сколько у вас баллов по русскому?', '');
    while(Number(Rysianlang)>100){
    alert('Не может быть более 100 баллов!');
    Rysianlang = prompt('Сколько у вас баллов по русскому?', '');
    }
    let GoldMedal = confirm("У тебя есть золотая медаль?");
    let DopBally = prompt('Сколько у вас дополнительных баллов (за олимпиады)?','');
    
    
    if(GoldMedal==true)
    DopBally+=5;
    
    if(DopBally>10)
    alert('Максимальное количество дополнительных баллов 10');
    
    if(Number(informat)<42||Number(math)<39||Number(Rysianlang)<40){
    let sad;
    if(math<39)
    sad = 'математике'
    if(informat<42)
    if(sad!=undefined)
    sad += ' и информатике';
    else sad = 'информатике';
    if(Rysianlang<40)
    if(sad!=undefined)
    sad += ' и русскому языку';
    else sad = 'русскому языку';
    alert(`К сожалению,с таким результатом по ${sad} , вы не сможете подать документы на наш факультет,обратитесь в университетский колледж`);
    }
    else{
    let Ball = Number(informat) + Number(math)+Number(Rysianlang)+Number(DopBally);
    if (Ball >= 230){
    alert( 'В 2019 году вы бы поступили на бюдежетные места,на такие направления как: \n«Компьютерная безопасность»\n«Информационная безопасность»\n«Прикладная математика и информатика»\n«Математика и компьютерные науки»\n\u{1F60D}'
    );
    }
    
    if(Ball >= 226 && Ball < 230){
    alert('В 2019 году вы бы поступили на бюдежетные места,на такие направления как:\n«Информационная безопасность»\n«Прикладная математика и информатика»\n«Математика и компьютерные науки»\n\u{1F60D}'
    );
    }
    
    if(Ball >= 219 && Ball < 226){
    alert('В 2019 году вы бы поступили на бюдежетные места,на такие направления как:\n«Прикладная математика и информатика»\n«Математика и компьютерные науки»\n\nВнебюдежетные места,на такие направления как:\n«Информационная безопасность» \n\u{1F60D}'
    );
    }
    
    if(Ball >= 212 && Ball < 219){
    alert('В 2019 году вы бы поступили на бюдежетные места,на такие направления как:\n«Математика и компьютерные науки»\n\nВнебюдежетные места,на такие направления как:\n«Информационная безопасность»\n«Прикладная математика и информатика»\n\u{1F60D}'
    );
    }
    if(Ball < 212 ){
    alert('В 2019 году вы бы поступили на внебюдежетные места,на такие направления как:\n«Информационная безопасность»\n«Прикладная математика и информатика»\n«Математика и компьютерные науки»\n\u{1F60D}'
    );
    }
    }
    retu = confirm("Посчитать ещё раз?");
}
window.close();
    </script>
    
</html>
